# 1. 什么是面向过程？什么是面向对象？（多行注释）
'''
面向过程
把完成某一个需求的所有步奏从头到尾逐步实现
根据开发需求，将某些功能独立的代码封装乘一个又一个函数
最后完成的代码，就是顺序地调用不同的函数
特点注重步奏与过程，不注重职责分工
开发复杂相符，没有固定的套路，开发难度大
面型对象
相比叫函数，面向对象时更大的封装，根据职责在一个对象中封装多个方法
在完成某一个需求钱，首先确定职责
根据职责确定不同的对象内部风中不同方法
注重对象和职责，不同的对象承担不同的职责
更加适合相对复杂的需求变化，时专门因对复杂项目开发，提供固定套路

'''

# 2. 为什么会出现面向对象的编程方式？面向对象解决了哪些问题？（多行注释）
'''
在硬件逐渐复杂的情况下，为了更好的维护软件所以出现了面向对象的编程方式。软件维护的问题
'''

# 3. 什么是类？什么是对象？（多行注释）
'''类时对一群具有相同特征或者行为的事物的一个同城，时抽象的，不能直接使用的
特征被成为属性
行为被成为方法
类相当于飞机制造的图纸时一个模板，时负责庄姜对象的
对象
对象是由类常遭出来的一个具体存在的，可以直接使用
由哪一个类装在出来的对象，又有在哪一类中定义的：属性方法
开发中现有类之后有对象
'''

# 4. 类包含哪些要素？（注意审题，不是面向对象的三要素，而是类包含的要素）
'''封装性、继承、多态'''